// By @Diddy444444 😁😁😁

internal class GPBDEDFKJNA : AAHMJHHPECM, ABNIEDHICDP, IBridgingEntity
{
	// Fields
	private const Int32 OPIAEJNGFOB; // 0x0 // private const Int32 SCATTER_NUM_IGNORE;
	private Single BNCDDKMAHGG; // 0x68 // private Single <NotReadyTimeFromPreWeapon>k__BackingField;
	private Byte[] PPPJHBAPCLG; // 0x70 // private Boolean <WeaponActive>k__BackingField;
	private Single <GDNGOIMOALI>k__BackingField; // 0x78 // private WeaponFireComponent <FireComponent>k__BackingField;
	private Single <PLMCHNCIOMJ>k__BackingField; // 0x7c
	private Boolean <KPDNNDMLKCM>k__BackingField; // 0x80 // protected WeaponBuffComponent m_WeaponBuffComponent;
	protected Single IEPMIOGIMFA; // 0x84
	public static readonly Int32 FGNAAAHCCBD; // 0x0 // public static readonly Int32 EDEFAULTITEM_DATAID;
	public const Single BEHNHMBFJMF; // 0x0 // public const Single TraceEffect3PLineRendererStartWidth;
	public const Single ADOCHMCHDAD; // 0x0 // public const Single TraceEffect3PLineRendererEndWidth;
	public const UInt32 KNBAMEDCMKK; // 0x0 // public const UInt32 NormalAimingAssistDamp;
	public const UInt32 OPHADBCIHJJ; // 0x0 // public const UInt32 NormalFireAimingAssistDamp;
	public const UInt32 IDPPFKNOCEL; // 0x0 // public const UInt32 SightAimingAssistDamp;
	public const UInt32 NCDGNAEGLKE; // 0x0 // public const UInt32 SightFireAimingAssistDamp;
	private CHEJCCHHDMH <NOAOCMKGLAH>k__BackingField; // 0x88 // protected WeaponStateMachine m_StateMachine;
	protected NJPAPMEKNPH OHJMAGIDHKB; // 0x90 // protected WeaponData m_WeaponData;
	protected BIEJHPCGHAJ FOBPFEDOBJL; // 0x98 // protected SpecialAttachmentInfo m_SpeicalAttachInfo;
	protected OOIPMACFIFL LAEMLAPIAFD; // 0xa0 // protected WeaponParams m_WeaponParams;
	protected HPMMGJBOEFE MDIFBGCDNDP; // 0xa8
	protected FKPFNILEOHE EFGDILOKKDP; // 0xb0
	protected NCALMHIGJKG JMFLBODJBFB; // 0x220
	protected OMFGKENGNON FJDOKPOPCHI; // 0x270
	protected KOMFNIHAJNK OCKJLPCBIMO; // 0x348
	protected FHNPPADMBGF BHMDAABMFBB; // 0x378 // protected WeaponSkinSwitchData m_WeaponSkinSwitchData;
	protected OGCCNJACMKF CPJOILIPGFA; // 0x3e0 // protected SkinWeaponCombineData m_SkinWeaponCombineData;
	protected WeaponSwitchBySightData DLHMLLPNPNL; // 0x3e8 // private ArrayMap`1 m_AttachmentSlots;
	protected NGPOABOKCNB ENCLIFFELHP; // 0x3f0 // protected WeaponImpactComponent m_WeaponImpactComponent;
	protected WeaponAimAssistAutoAbsorbData GCLOHFPIKGP; // 0x3f8 // protected WeaponUpgradeInfo m_WeaponUpgradeInfo;
	protected WeaponMountGrenadeData PDAKDJGNAGG; // 0x400 // protected IWeaponExpansionAbility m_ExpansionAbility;
	protected CFKEHCFMFNK EOENGAANICJ; // 0x408 // public Boolean UpdateOwnerAnim;
	protected WeaponMultiLineData LHKKEPFGLFB; // 0x410 // protected Single m_ExtraDamageToWalkingEnemy;
	protected AKIFEKGFLMO ECEKOPMCAAK; // 0x418 // private Single m_AttackBackExtarDamageAngle;
	protected Boolean DECEDCGNMIE; // 0x450 // public List`1 weaponAttribute;
	protected Int32 DFJIDIDOLGM; // 0x454
	private Boolean <ECKHHOLDAHM>k__BackingField; // 0x458 // protected Boolean m_WeaponSkinFistUseForeArm;
	protected UInt32 GNMHOINIMCD; // 0x45c // private Single m_LastReloadSuccessTime;
	protected UInt32 CBPMJONICAA; // 0x460 // private Single m_LastSwapSuccessTime;
	protected UInt32 CAMABJEGLPF; // 0x464 // private Single m_LastPullBoltTime;
	protected UInt32 GLGBJNGPPLH; // 0x468 // private Boolean <IsSegmentReloading>k__BackingField;
	protected WeaponSkinData ECGDELPAIDN; // 0x470 // protected AttachmentData m_GoldFamasAttachment;
	protected FJOCAIIBNLO HGAIGENIHFO; // 0x478 // protected Int32 m_ExtraDmgByHeight;
	private ArrayMap`1 FMMGFALCPAE; // 0x480 // protected Int32 m_ExtraDamageAfterHold;
	protected LLDPJHPAOCB FBFBKKOBBPG; // 0x488 // protected Single m_ExtraDmageToLowHpThreshold;
	protected LNMHBDNCHPP FHINPDOOBBJ; // 0x490 // private Dictionary`2 m_WeaponBuffAttribute;
	protected JHPKBPEGFFB EHLLAKEBLHH; // 0x498 // protected Int32 m_NextPlayFireEffectInterval;
	public Boolean NOKAIPLGFHI; // 0x4a0 // private List`1 m_HDFireEffectResourceList;
	protected Single KELPHOCIDKB; // 0x4a4
	protected Single APBBHOMMEHE; // 0x4a8 // protected GameObject m_FireSound;
	private Int32 HIAGOBKLGPF; // 0x4ac
	private Single HAHJIMMLDDB; // 0x4b0 // protected UInt32 m_StopDelayCall;
	protected Boolean GMGBICDJGNJ; // 0x4b4 // protected Boolean m_IsInLoopingSound;
	protected Single FPBJMMGOMFE; // 0x4b8 // private PlayerType m_LoopSoundPlayType;
	protected Int32 PHHKPGLANJM; // 0x4bc
	public ResourceID KCLJCBNNNEP; // 0x4c0 // private CombineType m_CombineType;
	private Single <EOEMHHJCDPK>k__BackingField; // 0x4c4 // private Boolean <IsHoldingFireForSingleShot>k__BackingField;
	private Single BHJBPCLKNIL; // 0x4c8 // private Single <ChargeRatio>k__BackingField;
	public Boolean FEIFHLBBMIF; // 0x4cc // private Single <ChargeDamageRatio>k__BackingField;
	public Boolean CNCOJBBGBCA; // 0x4cd
	protected ResourceID IKGEINEEKAE; // 0x4d0 // private Single <ChargeDuration>k__BackingField;
	protected ResourceID NOEMLEFAHLF; // 0x4d4 // private Single <GatlingFireInterval>k__BackingField;
	protected ResourceID MFNDEOEBKLD; // 0x4d8 // private Int32 <GatlingFireRank>k__BackingField;
	private ResourceID LABDGKIEGEF; // 0x4dc // private Boolean m_IsCombined;
	protected ResourceID JBPDKHMOBEE; // 0x4e0 // private Int32 m_AmmoLeftInCurrentClip;
	private ResourceID PNOCCCPFFHA; // 0x4e4 // private Boolean <IsInAutoCharge>k__BackingField;
	public List`1 LGIENBFIJOH; // 0x4e8 // private UInt32 <AutoChargeStartTickCount>k__BackingField;
	public List`1 PBLGGPGMJCM; // 0x4f0 // private Dictionary`2 m_BoostDamage;
	protected Boolean NKGDCOLECJJ; // 0x4f8 // protected TssSdtSmallFloat m_FireScatterFactor;
	protected Boolean NNKDKBBAGNH; // 0x4f9
	private Single KPFFHEACHLM; // 0x4fc
	private const Single GICCOFKEDPH; // 0x0 // private const Single ReloadContinueShootInterval;
	private Single IAPFNEEMJPJ; // 0x500 // protected UInt32 m_LastFireTickCount;
	private Single KLGCHAENKMK; // 0x504 // protected UInt32 m_LastStartFireReqTickCount;
	private Boolean <HPCPAHNLBFE>k__BackingField; // 0x508 // protected UInt32 m_LastFireTickCountNotIncludedCurTime;
	protected PFMPPELJECF HEFOLMHAFCF; // 0x510 // protected Single m_FireDuration;
	public const UInt32 OBOHBJLPFKE; // 0x0 // public const UInt32 GoldFamasAttachmentID;
	protected Int32 CEDMAMLDDOM; // 0x518 // protected Transform m_WeaponFirePointTF;
	protected Single FLPGGBENDGA; // 0x51c
	protected Int32 KPKMAPIIKOL; // 0x520 // protected ResourceID m_WeaponResId;
	protected Single FOCKLPOAMBA; // 0x524
	protected Single ILGGNGMCGCB; // 0x528 // protected GameObject m_WeaponGO;
	private Single CGMBLIDAPNH; // 0x52c
	private Dictionary`2 KCJGJMIAKAE; // 0x530 // protected ResourceID m_WeaponSecondaryResId;
	public const Single FJJKMEAIPLB; // 0x0 // public const Single SNIPER_WAIT_TIME;
	protected Int32 FCCEBKAPLOB; // 0x538 // protected GameObject m_WeaponSecondaryPartGO;
	private List`1 OLNOBOFDKHN; // 0x540 // protected TweenProperty[] m_WeaponTPs;
	protected GameObject AAPAEAKGKNM; // 0x548 // protected TweenProperty[] m_WeaponSecondaryPartTPs;
	protected UInt32 HNOINOEMEIH; // 0x550 // protected Transform m_WeaponRightFireEffectTF;
	protected Boolean FLACPHBJIAH; // 0x554
	protected Boolean AJMJEFKPLFL; // 0x555
	protected Boolean MNEDKFHCCOA; // 0x556
	private PlayerType EBPFOJCDMOB; // 0x558 // protected Transform m_WeaponLeftFireEffectTF;
	private JJLGMMCALJD IONNDFCJNGJ; // 0x560 // protected Animator m_WeaponRightFireAnim;
	private Boolean <HDCPAJCEMFE>k__BackingField; // 0x564
	private Single <NIFPJOKMNHF>k__BackingField; // 0x568 // protected Animator m_WeaponLeftFireAnim;
	private Single <BMNNBJLJNMI>k__BackingField; // 0x56c
	private Single <OFDFOKNHCMH>k__BackingField; // 0x570 // protected RuntimeAnimatorController m_WeaponAnimCtrl;
	private Single <KPJIPEKHPEP>k__BackingField; // 0x574
	private Int32 <BNHDHAHOPCN>k__BackingField; // 0x578 // protected RuntimeAnimatorController m_FPPWeaponAnimCtrl;
	private Boolean KCKCNEFGEGL; // 0x57c
	protected Boolean LAEHFGPNIOC; // 0x57d
	private Int32 HMEJNDMCLGK; // 0x580 // protected WeaponAnimComponent m_WeaponAnimationComponent;
	private Boolean <CFCIDEPPCND>k__BackingField; // 0x584
	private UInt32 <DFLDCELAEMM>k__BackingField; // 0x588 // protected UInt32 INNER_VISIBLE;
	private Dictionary`2 BOECJAEHOMG; // 0x590 // protected UInt32 DYING_VISIBLE;
	protected TssSdtSmallFloat JFPOKGAIJHA; // 0x598 // protected UInt32 SWIMMING_VISIBLE;
	protected UInt32 CJIPKMJAALM; // 0x5a0 // protected UInt32 PREPARATION_VISIBLE;
	protected UInt32 FFPAKPMKDNF; // 0x5a4 // protected UInt32 SKILL_VISIBLE;
	protected UInt32 LNEIGBIKHGJ; // 0x5a8 // protected UInt32 PROPERTY_VISIBLE;
	protected UInt32 HAEAIGKLENL; // 0x5ac // protected UInt32 ONFOLDWING_VISIBLE;
	protected Single EEJLKDDDJJD; // 0x5b0 // protected UInt32 SKATEBOARD_VISIBLE;
	protected UInt32 BPCCOKBMKHP; // 0x5b4 // protected UInt32 ONCHAIR_VISIBLE;
	protected Transform FPHKANPGEJE; // 0x5b8 // protected UInt32 USEINHALER_VISIBLE;
	protected ResourceID KBFJFKDIOHM; // 0x5c0 // protected UInt32 RELOAD_VISIBLE;
	protected GameObject LOOKBCDIAEA; // 0x5c8 // protected BitArrayBoolean m_WeaponVisibility;
	protected ResourceID NDLFIPPNDKH; // 0x5d0 // protected ResourceID m_FireEffectRes;
	protected GameObject KJNGHHOPBOG; // 0x5d8 // protected GameObject m_FireEffectGO;
	protected TweenProperty[] ILAEFECMEND; // 0x5e0 // protected ParticleSystem m_FireEffect;
	protected TweenProperty[] NOODMGNKAGK; // 0x5e8 // private GameObject m_BulletEffectGO;
	protected Transform CLPIAHJHFFB; // 0x5f0 // private ParticleSystem m_BulletEffect;
	protected Transform LHCJGAINHIM; // 0x5f8 // private Boolean m_HideWeaponWhenReload;
	protected Animator BACCCBKOBPE; // 0x600 // private ResourceID m_SecondFireEffectRes;
	protected Animator GOENHIJCCLI; // 0x608 // private GameObject m_SecondFireEffectGo;
	protected RuntimeAnimatorController LENLPLLAJFJ; // 0x610 // private ParticleSystem m_SecondFireEffect;
	protected RuntimeAnimatorController FNKKGDPMECK; // 0x618 // private Int32 m_FireShoted;
	protected WeaponAnimComponent LGMDNHIKIOK; // 0x620 // private UGCWeaponRepItem m_WeaponItem;
	protected UInt32 ABJILHPPBAC; // 0x628 // private Action`1 m_AsyncLoadDefaultModelCallBack;
	protected UInt32 CBLNKJPHLDL; // 0x62c
	protected UInt32 CODECJJKBGG; // 0x630 // private OnManagedInstanceAttached m_AsyncSecondFireEffectCallBack;
	protected UInt32 KBHCLGJFAAJ; // 0x634
	protected UInt32 KJNJMDFGDLA; // 0x638 // private OnManagedInstanceAttached m_AsyncFireEffectCallBack;
	protected UInt32 EBBBPIIHLIJ; // 0x63c
	protected UInt32 DCGKDCGNBOA; // 0x640 // protected Boolean m_CanAsyncLoadDefaultModel;
	protected UInt32 ILJACKBLJMB; // 0x644 // protected ResourceID m_AsyncDefaultModelRid;
	protected UInt32 PFBOPJMOELJ; // 0x648 // protected UInt32[] m_AsyncTicketDefaultModel;
	protected UInt32 AKOCKJIOCEM; // 0x64c
	protected UInt32 CMJJLNNAFEO; // 0x650 // protected UInt32[] m_AsyncTicketSkinModel;
	protected UInt32 BAFIGFOGMEA; // 0x654
	protected UInt32 MGHEHOOLNGN; // 0x658 // private UInt32[] m_AsyncTicketSkinEffect;
	protected UInt32 BIJNOKJEAAD; // 0x65c
	protected UInt32 DNMMMJMBMIM; // 0x660 // private Object[] m_AsyncSkinModelRes;
	protected BitArrayBoolean ALOGOHNIKGC; // 0x668 // private Object[] m_AsyncSkinEffectRes;
	protected ResourceID IHJELPCBKMA; // 0x670 // private Queue`1 m_Play3PGunTracePositionParameters;
	protected GameObject LAJJJCJHDGL; // 0x678 // private Queue`1 m_Play3PGunTraceFlagParameters;
	protected ParticleSystem LGDPBGEIBDJ; // 0x680 // private Dictionary`2 m_EntityVisualEffectUniqueIDs;
	private GameObject MGPLMPBDMLN; // 0x688 // private EntityVisualEffectManager m_EntityVisualEffectManager;
	private ParticleSystem BOBFAEAKLEK; // 0x690 // public Boolean CombineWeaponMutex;
	private Boolean GNKJICNCALI; // 0x698 // private UInt32 m_DelayCallMountGrenadeCounter;
	private ResourceID IPMPGEBCGFK; // 0x69c // private UInt32 m_LastMountGrenadeFiringTimeTickCount;
	private const String GCDDKMFODAC; // 0x0 // private const String m_BoneRightArm;
	private const String DCAIABCAEMJ; // 0x0 // private const String m_BoneLeftArm;
	private ResourceID FBMFEGPBKFN; // 0x6a0 // protected GameObject m_ChargeSoundGo;
	private GameObject HFMMJNGFGGO; // 0x6a8 // protected GameObject m_ChargingVfxGo;
	private ParticleSystem FPIKHCJEAHC; // 0x6b0 // protected GameObject m_ChargingMaxVfxGo;
	private Int32 HFLPIMNMLAN; // 0x6b8 // protected Boolean m_ChargeStarted;
	private UGCWeaponRepItem BDNNBAPKPNN; // 0x6c0 // private Boolean m_IsSighting;
	private Action`1 AFJGMLGCPOH; // 0x6c8 // private Single m_SightingEquipemntZoomAmplifier;
	private OnManagedInstanceAttached ONOBECKNAHG; // 0x6d0 // private AttachmentData m_CurSightingAttachmentData;
	protected OnManagedInstanceAttached GBAMACGAOEM; // 0x6d8 // private AttachmentData m_CurActivityAttachment;
	protected Boolean CEGFLCPOAJH; // 0x6e0 // private AttachmentData m_CurOverrideSightingAttachmentData;
	protected ResourceID GAAEPGLEBPF; // 0x6e4
	protected UInt32[] FCEHEDCLCJM; // 0x6e8 // private List`1 m_checkParams;
	protected UInt32[] BHBHOCEGOBB; // 0x6f0 // private Single[] m_sightAimCheckParams;
	private UInt32[] ECCADOHHFCE; // 0x6f8 // private Single[] m_weaponAimAssistCheckParam;
	private Object[] CIMCCILIBPK; // 0x700 // private Single[] m_weaponFPPAimAssistCheckParam;
	private Object[] BPJNNMCMMGP; // 0x708 // protected Boolean m_CostAmmo;
	private Queue`1 DNOGJAEDOEF; // 0x710 // protected BitArrayBoolean m_FPPWeaponVisibility;
	private Queue`1 AOODEGIHEMP; // 0x718 // protected GameObject m_WeaponFPPGO;
	private Dictionary`2 CBGADBFIKMJ; // 0x720 // public Boolean IsABReady;
	private EntityVisualEffectManager GHJGPAKJLNA; // 0x728 // protected WeaponAnimComponent m_WeaponFPPAnimComp;
	public Boolean FCMADFPDPLF; // 0x730 // private UInt32 m_AsyncTicketFppSkinEffect;
	private Boolean ACCNHIIBHKM; // 0x731
	private const Single LNBFIIAGCDC; // 0x0 // private const Single CHANGEWEAPON_ANIM_TIME;
	public Boolean LPILMCJIDKF; // 0x732
	private Boolean EMBPNIGDHJD; // 0x733
	private Int32 CDGLKJIGCCP; // 0x734
	private UInt32 DLBEALNCCCG; // 0x738 // private Transform m_EffectTansform;
	private UInt32 CFPIOILHNMG; // 0x73c
	protected GameObject FIGDDGKJIJN; // 0x740 // private Transform m_WeaponIKTargetTF;
	protected GameObject PJLIMACFGJG; // 0x748 // private Transform m_WeaponIKTargetRightTF;
	protected GameObject COPNKJNKMBI; // 0x750 // private FPPWeaponData m_FPPWPData;
	protected Boolean PLHDPJKGLAO; // 0x758 // private FPPCollectionWeapon m_FPPWPSkinData;
	protected Boolean OKKJNPGJJOH; // 0x759
	private Single HAADIBBHBEB; // 0x75c
	private Boolean GAFGBLFCKAF; // 0x760 // private WeaponRuntimeExParams m_RuntimeExParams;
	private Boolean IOKEAMKJOMM; // 0x761
	private UInt32 MMMIGFMEDBO; // 0x764
	private Single JKAAFGDOAHH; // 0x768
	private PFMPPELJECF NOCGIMNCJNG; // 0x770
	private PFMPPELJECF JEALBPPGJFO; // 0x778
	private PFMPPELJECF JBJNMOMCHJM; // 0x780
	private List`1 PIGOIHAOJGH; // 0x788
	private Single[] DPBGHMIEOON; // 0x790
	private Single[] FNDALMELDKK; // 0x798
	private Single[] COJEKBLMNBG; // 0x7a0
	protected Boolean FFKOFNIMMBD; // 0x7a8
	protected BitArrayBoolean FINIBHOJMMM; // 0x7b0
	protected GameObject FEADNHHGAKG; // 0x7b8
	public Boolean LLKMCOKFCDD; // 0x7c0
	protected WeaponAnimComponent HIEPOBNNDNH; // 0x7c8
	private UInt32 GGJPBFABHEL; // 0x7d0
	private Transform MJCBHGEPBBG; // 0x7d8
	private Transform BLLCDDEFODN; // 0x7e0
	private Transform DLBJDGCGCKJ; // 0x7e8
	private FECLDOIJIBE OECABIJOBMH; // 0x7f0
	private FPPCollectionWeapon KLBMILAKPKC; // 0x7f8
	private BFCKCJEDAHC PGHDCBKPAKG; // 0x800
	private Boolean CGPENDDFNNN; // 0x808

	// Properties
	public String HGOKJCJJEHD { get; } // public String UGCEntityID { get; }
	public Single IMKPOKLGEAH { get; set; } // public Single NotReadyTimeFromPreWeapon { get; set; }
	public Single GLLKAIHFIAJ { get; set; } // public Single ChangeWeaponTime { get; set; }
	public Boolean PEOANDFEBED { get; set; } // public Boolean WeaponActive { get; set; }
	public CHEJCCHHDMH DKNPGJAKMPB { get; set; } // public WeaponFireComponent FireComponent { get; set; }
	public WeaponMultiLineData HCAADHGJDPF { get; } // public UInt32 WeaponSkinId { get; }
	public UInt32 IAENCEKHCHJ { get; } // public UInt32 WeaponPropertySkinID { get; }
	public UInt32 NAGHNGCCPBK { get; } // public UInt32 WeaponBuffSkinID { get; }
	public UInt32 PJJDBEKFDMM { get; } // public Boolean CacheTriggered { get; set; }
	public Boolean IGDJPJKAJGN { get; set; } // public UInt32 WeaponExecuteSkillID { get; }
